# GetDiagonalLength Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Outline..::..GetDiagonalLength Method
Outline Class See Also
---
Get the length of outline's diagonal. If called on empty outline, 0. is returned
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public double GetDiagonalLength()
```

Visual Basic
---
```text
Public Function GetDiagonalLength As Double
```

Visual C++
---
```text
public:
double GetDiagonalLength()
```

# ### Return Value
The length of the diagonal.
# See Also
Outline Class
Autodesk.Revit.DB Namespace